# Essential DataFrame Operations

In [ ]:
import pandas as pd
import numpy as np

## Selecting multiple DataFrame columns

In [3]:
movie = pd.read_csv('../section1/data/movies.csv')
movie.columns

Index(['Film', 'Genre', 'Lead Studio', 'Audience score %', 'Profitability',
       'Rotten Tomatoes %', 'Worldwide Gross', 'Year'],
      dtype='object')

In [4]:
movie_three_subset_cols = movie[['Film', 'Audience score %', 'Year']]
movie_three_subset_cols.head()

                                 Film  Audience score %    Year
0          Zack and Miri Make a Porno                70  2008.0
1                     Youth in Revolt                52  2010.0
2  You Will Meet a Tall Dark Stranger                35  2010.0
3                        When in Rome                44  2010.0
4               What Happens in Vegas                72  2008.0

Passing a **list** of columns it will return a new DataFrame and not a Series

In [8]:
movie[['Year']].head()

     Year
0  2008.0
1  2010.0
2  2010.0
3  2010.0
4  2008.0

It is important to put the desired sebset of columns that I want to get from the main DataFrame into a list. If I do something like *movie['Film', 'Audience score %', 'Year']* will throw a *KeyError* since this is a **tuple** and not a list. So pandas will try to find the column with that tuple specified and since it does not exits, will throw an error.

Tuple examples

In [9]:
tuple1 = 1, 2, 3, 'a', 'b', 'c'
tuple1

(1, 2, 3, 'a', 'b', 'c')

In [10]:
tuple2 = (1, 2, 3, 'a', 'b', 'c')
tuple2

(1, 2, 3, 'a', 'b', 'c')

In [13]:
tuple1 == tuple2

True

## Selecting columns with methods

In [14]:
movie = pd.read_csv('../section1/data/movies.csv')

The method **get_dtype_counts()** outputs the number of columns for each specific dtype

In [15]:
movie.get_dtype_counts()

float64    2
int64      2
object     4
dtype: int64

The method **select_dtypes(include=*list*)** selects only the columns which has the dtypes specified in the *list* attribute

In [23]:
movie.select_dtypes(include=['integer', 'object']).head()

   Audience score %  Profitability  Rotten Tomatoes %    Year
0                70       1.747542                 64  2008.0
1                52       1.090000                 68  2010.0
2                35       1.211818                 43  2010.0
3                44       0.000000                 15  2010.0
4                72       6.267647                 28  2008.0

In [26]:
movie.select_dtypes(include=['number']).head()

   Audience score %  Profitability  Rotten Tomatoes %    Year
0                70       1.747542                 64  2008.0
1                52       1.090000                 68  2010.0
2                35       1.211818                 43  2010.0
3                44       0.000000                 15  2010.0
4                72       6.267647                 28  2008.0

The method **filter** with the attibute **like** attempts to find all the column names that contains the exact string specified in the *like* attribute

In [29]:
movie['Year_for_testing'] = (movie['Year'] * 2)

In [31]:
movie.filter(like='Year').head()

     Year  Year_for_testing
0  2008.0            4016.0
1  2010.0            4020.0
2  2010.0            4020.0
3  2010.0            4020.0
4  2008.0            4016.0

To find all the column names that contains a digit, **regex** attribute can be used in *filter* method. Passing to regex the parameter '**\d**', all the columns that contains at least a single digit from *0* to *9* are selected

In [33]:
movie['test0'] = 0
movie['test12'] = 12
movie.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year,Year_for_testing,test0,test12
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0,4016.0,0,12
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0,4020.0,0,12
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0,4020.0,0,12
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0,4020.0,0,12
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0,4016.0,0,12

In [35]:
movie.filter(regex='\d').head()

   test0  test12
0      0      12
1      0      12
2      0      12
3      0      12
4      0      12

Filter comes with another attribute: **items**.This attribute takes a list of column names exactly as the indexing operator (*movie[['Film', 'Audience score %', 'Year']]*) with the difference that a KeyError will not be raised id one of the string does not match a column name

In [36]:
movie.filter(items=['Film','abcd']).head()

                                 Film
0          Zack and Miri Make a Porno
1                     Youth in Revolt
2  You Will Meet a Tall Dark Stranger
3                        When in Rome
4               What Happens in Vegas

## Ordering column names sensibly

In [37]:
movie = pd.read_csv('../section1/data/movies.csv')
movie.head()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008.0
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010.0
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010.0
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010.0
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008.0

It is important to give an order to our columns and dividing the from continuos to discrete values

In [38]:
film_details = ['Film', 'Genre', 'Lead Studio', 'Year']
other_details = ['Profitability', 'Audience score %', 'Rotten Tomatoes %', 'Worldwide Gross']

After that, we concatenate all the lists together to obtain the final order column. Before proceeding, it is important to check whether all the columns are included

In [46]:
final_order = film_details + other_details
set(movie.columns) == set(final_order)

True

Finally we pass the list with the new column order to the indexing operator of the DataFrame to reorder the columns

In [47]:
movie2 = movie[final_order]
movie2.head()

,Film,Genre,Lead Studio,Year,Profitability,Audience score %,Rotten Tomatoes %,Worldwide Gross
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,2008.0,1.747542,70,64,$41.94
1,Youth in Revolt,Comedy,The Weinstein Company,2010.0,1.090000,52,68,$19.62
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,2010.0,1.211818,35,43,$26.66
3,When in Rome,Comedy,Disney,2010.0,0.000000,44,15,$43.04
4,What Happens in Vegas,Comedy,Fox,2008.0,6.267647,72,28,$219.37

## Operating on the entire DateFrame

In [48]:
movie = pd.read_csv('../section1/data/movies.csv')

In [49]:
movie.shape

(77, 8)

The **size** attribute returns the product *rows * columns*

In [50]:
movie.size

616

The **ndim** attribute returns the number of dimensin of a DataFrame which is 2 for all DataFrames

In [52]:
movie.ndim

2

In [57]:
movie.describe()

       Audience score %  Profitability  Rotten Tomatoes %         Year
count         77.000000      77.000000          77.000000    76.000000
mean          63.727273       4.599483          46.701299  2009.078947
std           13.657113       8.031990          26.095001     1.363947
min           35.000000       0.000000           3.000000  2007.000000
25%           52.000000       1.751351          26.000000  2008.000000
50%           64.000000       2.642353          45.000000  2009.000000
75%           76.000000       5.103117          64.000000  2010.000000
max           89.000000      66.934000          96.000000  2011.000000

## Chaining DataFrame methods together

In [59]:
movie = pd.read_csv('../section1/data/movies.csv')
movie.isnull().tail()

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
72,False,False,False,False,False,False,False,False
73,False,False,False,False,False,False,False,False
74,False,False,False,False,False,False,False,False
75,False,False,False,False,False,False,False,False
76,False,False,False,False,False,False,False,True

In [60]:
movie.isnull().get_dtype_counts()

bool    8
dtype: int64

In [62]:
movie.isnull().sum()

Film                 0
Genre                0
Lead Studio          0
Audience score %     0
Profitability        0
Rotten Tomatoes %    0
Worldwide Gross      0
Year                 1
dtype: int64

In [63]:
movie.isnull().sum().sum()

1

The chained method **isnull().any()** returns true whether at least one missing value is present

In [69]:
movie.isnull().any()

Film                 False
Genre                False
Lead Studio          False
Audience score %     False
Profitability        False
Rotten Tomatoes %    False
Worldwide Gross      False
Year                  True
dtype: bool

In [70]:
movie.isnull().any().any()

True

## Working with operator on a DataFrame

In [81]:
college = pd.read_csv('data/college.csv')
rename_unamed = {'Unnamed: 0': 'University Name'}
college = college.rename(columns=rename_unamed)
college

,University Name,Private,Apps,Accept,Enroll,Top10perc,Top25perc,F.Undergrad,P.Undergrad,Outstate,Room.Board,Books,Personal,PhD,Terminal,S.F.Ratio,perc.alumni,Expend,Grad.Rate
0,Abilene Christian University,Yes,1660,1232,721,23,52,2885,537,7440,3300,450,2200,70,78,18.1,12,7041,60
1,Adelphi University,Yes,2186,1924,512,16,29,2683,1227,12280,6450,750,1500,29,30,12.2,16,10527,56
2,Adrian College,Yes,1428,1097,336,22,50,1036,99,11250,3750,400,1165,53,66,12.9,30,8735,54
3,Agnes Scott College,Yes,417,349,137,60,89,510,63,12960,5450,450,875,92,97,7.7,37,19016,59
4,Alaska Pacific University,Yes,193,146,55,16,44,249,869,7560,4120,800,1500,76,72,11.9,2,10922,15
5,Albertson College,Yes,587,479,158,38,62,678,41,13500,3335,500,675,67,73,9.4,11,9727,55
6,Albertus Magnus College,Yes,353,340,103,17,45,416,230,13290,5720,500,1500,90,93,11.5,26,8861,63
7,Albion College,Yes,1899,1720,489,37,68,1594,32,13868,4826,450,850,89,100,13.7,37,11487,73
8,Albright College,Yes,1038,839,227,30,63,973,306,15595,4400,300,500,79,84,11.3,23,11644,80
9,Alderson-Broaddus College,Yes,582,498,172,21,44,799,78,10468,3380,660,1800,40,41,11.5,15,8991,52
10,Alfred University,Yes,1732,1425,472,37,75,1830,110,16548,5406,500,600,82,88,11.3,31,10932,73
11,Allegheny College,Yes,2652,1900,484,44,77,1707,44,17080,4440,400,600,73,91,9.9,41,11711,76
12,Allentown Coll. of St. Francis de Sales,Yes,1179,780,290,38,64,1130,638,9690,4785,600,1000,60,84,13.3,21,7940,74
13,Alma College,Yes,1267,1080,385,44,73,1306,28,12572,4552,400,400,79,87,15.3,32,9305,68
14,Alverno College,Yes,494,313,157,23,46,1317,1235,8352,3640,650,2449,36,69,11.1,26,8127,55
15,American International College,Yes,1420,1093,220,9,22,1018,287,8700,4780,450,1400,78,84,14.7,19,7355,69
16,Amherst College,Yes,4302,992,418,83,96,1593,5,19760,5300,660,1598,93,98,8.4,63,21424,100
17,Anderson University,Yes,1216,908,423,19,40,1819,281,10100,3520,550,1100,48,61,12.1,14,7994,59
18,Andrews University,Yes,1130,704,322,14,23,1586,326,9996,3090,900,1320,62,66,11.5,18,10908,46
19,Angelo State University,No,3540,2001,1016,24,54,4190,1512,5130,3592,500,2000,60,62,23.1,5,4010,34
20,Antioch University,Yes,713,661,252,25,44,712,23,15476,3336,400,1100,69,82,11.3,35,42926,48
21,Appalachian State University,No,7313,4664,1910,20,63,9940,1035,6806,2540,96,2000,83,96,18.3,14,5854,70
22,Aquinas College,Yes,619,516,219,20,51,1251,767,11208,4124,350,1615,55,65,12.7,25,6584,65
23,Arizona State University Main campus,No,12809,10308,3761,24,49,22593,7585,7434,4850,700,2100,88,93,18.9,5,4602,48
24,Arkansas College (Lyon College),Yes,708,334,166,46,74,530,182,8644,3922,500,800,79,88,12.6,24,14579,54
25,Arkansas Tech University,No,1734,1729,951,12,52,3602,939,3460,2650,450,1000,57,60,19.6,5,4739,48
26,Assumption College,Yes,2135,1700,491,23,59,1708,689,12000,5920,500,500,93,93,13.8,30,7100,88
27,Auburn University-Main Campus,No,7548,6791,3070,25,57,16262,1716,6300,3933,600,1908,85,91,16.7,18,6642,69
28,Augsburg College,Yes,662,513,257,12,30,2074,726,11902,4372,540,950,65,65,12.8,31,7836,58
29,Augustana College IL,Yes,1879,1658,497,36,69,1950,38,13353,4173,540,821,78,83,12.7,40,9220,71
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
747,Westfield State College,No,3100,2150,825,3,20,3234,941,5542,3788,500,1300,75,79,15.7,20,4222,65
748,Westminster College MO,Yes,662,553,184,20,43,665,37,10720,4050,600,1650,66,70,12.5,20,7925,62
749,Westminster College,Yes,996,866,377,29,58,1411,72,12065,3615,430,685,62,78,12.5,41,8596,80
750,Westminster College of Salt Lake City,Yes,917,720,213,21,60,979,743,8820,4050,600,2025,68,83,10.5,34,7170,50
751,Westmont College,No,950,713,351,42,72,1276,9,14320,5304,490,1410,77,77,14.9,17,8837,87
752,Wheaton College IL,Yes,1432,920,548,56,84,2200,56,11480,4200,530,1400,81,83,12.7,40,11916,85
753,Westminster College PA,Yes,1738,1373,417,21,55,1335,30,18460,5970,700,850,92,96,13.2,41,22704,71
754,Wheeling Jesuit College,Yes,903,755,213,15,49,971,305,10500,4545,600,600,66,71,14.1,27,7494,72
755,Whitman College,Yes,1861,998,359,45,77,1220,46,16670,4900,750,800,80,83,10.5,51,13198,72
756,Whittier College,Yes,1681,1069,344,35,63,1235,30,16249,5699,500,1998,84,92,13.6,29,11778,52
757,Whitworth College,Yes,1121,926,372,43,70,1270,160,12660,4500,678,2424,80,80,16.9,20,8328,80
758,Widener University,Yes,2139,1492,502,24,64,2186,2171,12350,5370,500,1350,88,86,12.6,19,9603,63
759,Wilkes University,Yes,1631,1431,434,15,36,1803,603,11150,5130,550,1260,78,92,13.3,24,8543,67
760,Willamette University,Yes,1658,1327,395,49,80,1595,159,14800,4620,400,790,91,94,13.3,37,10779,68
761,William Jewell College,Yes,663,547,315,32,67,1279,75,10060,2970,500,2600,74,80,11.2,19,7885,59
762,William Woods University,Yes,469,435,227,17,39,851,120,10535,4365,550,3700,39,66,12.9,16,7438,52
763,Williams College,Yes,4186,1245,526,81,96,1988,29,19629,5790,500,1200,94,99,9.0,64,22014,99
764,Wilson College,Yes,167,130,46,16,50,199,676,11428,5084,450,475,67,76,8.3,43,10291,67
765,Wingate College,Yes,1239,1017,383,10,34,1207,157,7820,3400,550,1550,69,81,13.9,8,7264,91
766,Winona State University,No,3325,2047,1301,20,45,5800,872,4200,2700,300,1200,53,60,20.2,18,5318,58
767,Winthrop University,No,2320,1805,769,24,61,3395,670,6400,3392,580,2150,71,80,12.8,26,6729,59
768,Wisconsin Lutheran College,Yes,152,128,75,17,41,282,22,9100,3700,500,1400,48,48,8.5,26,8960,50
769,Wittenberg University,Yes,1979,1739,575,42,68,1980,144,15948,4404,400,800,82,95,12.8,29,10414,78
770,Wofford College,Yes,1501,935,273,51,83,1059,34,12680,4150,605,1440,91,92,15.3,42,7875,75
771,Worcester Polytechnic Institute,Yes,2768,2314,682,49,86,2802,86,15884,5370,530,730,92,94,15.2,34,10774,82
772,Worcester State College,No,2197,1515,543,4,26,3089,2029,6797,3900,500,1200,60,60,21.0,14,4469,40
773,Xavier University,Yes,1959,1805,695,24,47,2849,1107,11520,4960,600,1250,73,75,13.3,31,9189,83
774,Xavier University of Louisiana,Yes,2097,1915,695,34,61,2793,166,6900,4200,617,781,67,75,14.4,20,8323,49
775,Yale University,Yes,10705,2453,1317,95,99,5217,83,19840,6510,630,2115,96,96,5.8,49,40386,99
776,York College of Pennsylvania,Yes,2989,1855,691,28,63,2988,1726,4990,3560,500,1250,75,75,18.1,28,4509,99

In [86]:
college.filter(like='Under').head() + 5

   F.Undergrad  P.Undergrad
0         2890          542
1         2688         1232
2         1041          104
3          515           68
4          254          874

## Comparing missing values

In [87]:
np.nan == np.nan

False

In [88]:
None == None

True

In [89]:
np.nan > 5

False

In [91]:
np.nan != 5

True

In [92]:
np.nan != np.nan

True